In [ ]:
#relational databases have multiple tables with defined relationships between them
#each database has a schema that defines the structure of the database, including the tables
# and the relationships between them
Albums table
AlbumId INTEGER PRIMARY KEY
AlbumName VARCHAR(20)
ArtistId INT
GenreId INT
#columns can have various data types such as INTEGER,VARCHAR() OR CHAR(),DATE
"""
Keys : 1. Primary Key : column that uniquely identifies each row in a table
       2. Foreign Key: column that references the primary key of another table. Primary Key of a table is a foreign key in
       another table

"""
##commenting in sql
-- single line comment
/* multi line comment */

# using Pandas to read sql tables

In [ ]:
import sqlite3 
conn = sqlite3.connect('data.sqlite') #connect to the data.sqlite database

#SCHEMA OF THE DATABASE
schema_df = pd.read_sql("""
               SELECT *
               FROM sqlite_master
                        """,conn)

import pandas as pd
employees_df = pd.read_sql("""SELECT * FROM employees;""", conn)
employees_df.dtypes #data types of the columns
             .info() #information about the columns
             .describe() #summary statistics of the columns

##selecting columns
employees_df = pd.read_sql("""SELECT lastName, firstName FROM employees;""", conn)
employees_df.head()

or
pd.read_sql("""SELECT lastName, firstName FROM employees;""", conn).head()

##
pd.read_sql("""
SELECT lastName, firstName
  FROM employees;
""", conn).head() # first 5 rows of the columns lastName and firstName

##
pd.read_sql("""
SELECT firstName AS name
  FROM employees;
""", conn).head() # first 5 rows of the column firstName with the alias name

##
pd.read_sql("""
SELECT firstName, lastName, jobTitle,
       CASE
       WHEN jobTitle = "Sales Rep" THEN "Sales Rep"
       ELSE "Not Sales Rep"
       END AS role
  FROM employees;
""", conn).head(10) # first 10 rows of the columns firstName, lastName, jobTitle and role


#after every query 
conn.close()  #close the connection

# Data Definition language

In [ ]:
## create table
CREATE TABLE actor ( #actor- table name
    actor_id String(32767), #actor_id - column 1 name
    first_name String(32767),
    last_name String(32767),
    last_update String(32767)
);

#alter table
#1. add column 
ALTER TABLE actor ADD country String(32767); #country is the column name
#2.rename column 
ALTER TABLE actor RENAME COLUMN country TO country_name; 
#3. drop column 
ALTER TABLE actor DROP COLUMN country_name;
#4. modify the data type of a column 
ALTER TABLE actor MODIFY COLUMN actor_id INTEGER; #change the data type of actor_id to INTEGER


#rename table
RENAME TABLE actor TO actor_names; #rename the table name actor to actor_names

#truncate table
TRUNCATE TABLE actor_names; #delete all rows from the table actor_names

#drop table
DROP TABLE actor_names; #delete the table actor_names. The data as well as all the data in it.

# LOGICAL FLOW OF SYNTAX
Logical Flow: SQL queries generally follow a logical flow:

    SELECT: Specify which columns or expressions to retrieve.
    FROM: Identify the tables from which to retrieve data.
    JOIN: Link tables together based on specified conditions.
    WHERE: Filter rows based on specific conditions.
    GROUP BY: Group rows that have the same values into summary rows.
    HAVING: Filter group rows after the GROUP BY clause.
    ORDER BY: Sort the result set based on specified columns.
    LIMIT/OFFSET: Control the number of rows returned and start point for fetching rows.

    DISTINCT: returns distinct values of a column 
       you can COUNT(DISTINCT column)- to get count of each distinct value

# Data Query Language

In [ ]:
/* using select
SELECT * FROM actor_names; #selects all columns from the actor_names table

SELECT first_name, last_name FROM actor_names; #selects all rows in only the first_name and last_name columns from the actor_names table

SELECT first_name, last_name FROM actor_names WHERE first_name = 'John'; #selects all rows in the first_name and last_name columns from the actor_names table where the first_name column is 'John'

SELECT * FROM actor_names WHERE first_name = 'John' AND last_name = 'Doe'; #selects all rows from the actor_names table where the first_name column is 'John' and the last_name column is 'Doe'

SELECT * FROM actor_names WHERE first_name = 'John' OR last_name = 'Doe'; #selects all rows from the actor_names table where the first_name column is 'John' or the last_name column is 'Doe'

SELECT * FROM actor_names WHERE first_name = 'John' OR last_name = 'Doe' ORDER BY last_name; #selects all rows from the actor_names table where the first_name column is 'John' or the last_name column is 'Doe', and orders the results by the last_name column

SELECT * FROM actor_names WHERE first_name = 'John' OR last_name = 'Doe' ORDER BY last_name DESC; #selects all rows from the actor_names table where the first_name column is 'John' or the last_name column is 'Doe', and orders the results by the last_name column in descending order

SELECT * FROM actor_names WHERE first_name = 'John' OR last_name = 'Doe' ORDER BY last_name DESC LIMIT 10; #selects the first 10 rows from the actor_names table where the first_name column is 'John' or the last_name column is 'Doe', and orders the results by the last_name column in descending order

SELECT * FROM actor_names WHERE first_name = 'John' OR last_name = 'Doe' ORDER BY last_name DESC LIMIT 10 OFFSET 5; #selects the 6th through 15th rows from the actor_names table where the first_name column is 'John' or the last_name column is 'Doe', and orders the results by the last_name column in descending order

# SELECT COUNT
SELECT COUNT () FROM actor_names; #counts the number of rows in the actor_names table

SELECT COUNT (*) FROM actor_names WHERE first_name = 'John'; #counts the number of rows in the actor_names table where the first_name column is 'John'

#SELECT COUNT IN SPECIFIC COLUMNS
SELECT COUNT (first_name) FROM actor_names; #counts the number of rows in the first_name column of the actor_names table

##DISTINCT 
SELECT COUNT(DISTINCT first_name) FROM actor_names; #counts the number of unique values in the first_name column of the actor_names table

SELECT DISTINCT first_name, country FROM actor_names; #selects all unique combinations of values in the first_name and country columns of the actor_names table

#use aliases (AS keyword) to change the column names in our query result:
SELECT first_name, last_name AS surname FROM actor_names; #selects the first_name and last_name columns from the actor_names table, and renames the last_name column to surname in the query result

#length
SELECT LENGTH(first_name) AS name_length FROM actor_names; #finds the length of every value in the first_name column of the actor_names table, and renames the result column to name_length

#upper
SELECT UPPER(first_name) AS upper_name FROM actor_names; #converts all values in the first_name column of the actor_names table to uppercase, and renames the result column to upper_name

#substr
SELECT SUBSTR(first_name, 1, 2) AS initials FROM actor_names; #selects the first two characters of every value in the first_name column of the actor_names table, and renames the result column to initials
 SELECT SUBSTR(first_name, 1, 1) AS initials FROM actor_names; #selects the first character of every value in the first_name column of the actor_names table, and renames the result column to initials

#concat
SELECT first_name || '' || last_name AS full_name FROM actor_names; #concatenates the first_name and last_name columns of the actor_names table, and renames the result column to full_name

#group by
SELECT first_name, COUNT(*) FROM actor_names GROUP BY first_name; #groups the rows in the actor_names table by the first_name column, and counts the number of rows in each group

#having
SELECT first_name, COUNT(*) FROM actor_names GROUP BY first_name HAVING COUNT(*) > 1; #groups the rows in the actor_names table by the first_name column, and counts the number of rows in each group, only returning groups with more than one row


#MATH 
#1. ROUND
SELECT round(priceEach) AS rounded_price
  FROM orderDetails; #rounds the priceEach column of the orderDetails table to the nearest whole number

  #2. CAST
  SELECT CAST(round(priceEach) AS INTEGER) AS rounded_price_int
  FROM orderDetails; #rounds the priceEach column of the orderDetails table to the nearest whole number, and casts the result to an integer

#BASIC MATH
SELECT priceEach * quantityOrdered AS total_price
  FROM orderDetails;  #multiplies the priceEach and quantityOrdered columns of the orderDetails table, and renames the result column to total_price

#SELECT SUM
SELECT SUM (actor_id) FROM actor_names; #sums the values in the actor_id column of the actor_names table

#SELECT AVG
SELECT AVG (actor_id) FROM actor_names; #calculates the average of the values in the actor_id column of the actor_names table

#SELECT MIN
SELECT MIN (actor_id) FROM actor_names; #finds the smallest value in the actor_id column of the actor_names table

#SELECT JULIANDAY
SELECT julianday(requiredDate) - julianday(orderDate) AS days_from_order_to_required
  FROM orders; #calculates the number of days between the orderDate and requiredDate columns of the orders table

SELECT orderDate, date(orderDate, "+7 days") AS one_week_later
  FROM orders; #Selects orderDate column and 7 days after as well

#strftime - format date
SELECT orderDate,
       strftime("%m", orderDate) AS month,
       strftime("%Y", orderDate) AS year,
       strftime("%d", orderDate) AS day
  FROM orders;

#RENAME COLUMNS
SELECT country AS 'Airport Country', city AS 'Airport City'
FROM airports;

## CASE Statements 
Start with CASE 

END With END

In [ ]:
#1. CASE statement TO BIN COLUMN VALUES - to add values to a new column based on the values in an existing column
SELECT first_name, last_name, job_title,
CASE 
WHEN job_title = 'Engineer' THEN 'Engineering'
WHEN job_title = 'Analyst' THEN 'Analytics'
ELSE 'Other'
END AS department 
FROM employee;


#2. TO MAKE HUMAN READABLE COLUMN VALUES
SELECT first_name, last_name, office_id,
CASE Office_id #to prevent repetition of the name office_id
WHEN '1' THEN 'New York'
WHEN '2' THEN 'San Francisco'
WHEN '3' THEN 'Chicago'
ELSE 'Other'
END AS office_location
FROM employee; #creates a new column office_location with human-readable values based on the values in the office_id column

## where clause

In [ ]:
#WHERE CLAUSE
SELECT first_name AS 'First Name',
last_name AS 'Last Name',

FROM employee
WHERE office_id = '1' AND
'First Name' = 'John' AND
'Last Name' = 'Doe' AND
'Age' BETWEEN 20 AND 50 AND
'Salary' > 50000

#IS OPERATOR - to check for NULL values/not null values
SELECT first_name, last_name, email
FROM employee
WHERE email IS NOT NULL; OR IS NULL #selects all rows from the employee table where the email column is NULL

pd.read_sql("""
SELECT *, length(firstName) AS name_length 
  FROM employees
 WHERE name_length = 5;
""", conn) #add a new column name_length to the employees table that contains the length of the firstName column,
#and then select all rows from the employees table where the name_length column is 5

pd.read_sql("""
SELECT *, substr(firstName, 1, 1) AS first_initial
  FROM employees
 WHERE first_initial = "L";
""", conn) #add a new column first_initial to the employees table that contains the first character of the firstName column,

pd.read_sql("""
SELECT *, CAST(round(priceEach) AS INTEGER) AS rounded_price_int
  FROM orderDetails
 WHERE rounded_price_int = 30;
""", conn)#add a new column rounded_price_int to the orderDetails table that contains the rounded priceEach column as an integer,

pd.read_sql("""
SELECT *, strftime("%m", orderDate) AS month
  FROM orders
 WHERE month = "01";
""", conn) #add a new column month to the orders table that contains the month of the orderDate column,


SELECT *
  FROM orders
 WHERE status IN ("Cancelled", "Resolved") #selects all rows from the orders table where the status column is either "Cancelled" or "Resolved"
 ORDER BY length(comments) DESC
 LIMIT 10;

## GROUP BY

A GROUP BY statement sorts data by grouping it based on column(s) you specify in the query.
Mainly used with aggregate functions  (COUNT(), MAX(), MIN(), SUM(), AVG()) to group the result-set by one or more columns.

In [ ]:
#group by
SELECT first_name, COUNT(*) 
FROM employee GROUP BY first_name; #groups the rows in the employee table by the first_name column, and counts the number of rows in each group

#after WHERE CLAUSE
SELECT first_name, COUNT(*)
    FROM employee
     WHERE office_id = '1'
     GROUP BY first_name; #groups the rows in the employee table by the first_name column, and counts the number of rows in each group where the office_id column is '1' or 
#group by index 1 since first_name is the second column in the SELECT statement


SELECT
    customerNumber,
    COUNT(*) AS number_payments,
    MIN(amount) AS min_purchase,
    MAX(amount) AS max_purchase,
    AVG(amount) AS avg_purchase,
    SUM(amount) AS total_spent
FROM payments
WHERE strftime('%Y', paymentDate) = '2004'
GROUP BY customerNumber #groups the rows in the payments table by the customerNumber column, and calculates the number of payments, minimum purchase amount, maximum purchase amount, average purchase amount, and total spent for each customer in 2004

;

## HAVING CLAUSE
 The HAVING clause works similarly to the WHERE clause, except it is used to filter data selections on conditions after the GROUP BY clause.
 Mainly used with aggregate functions

In [ ]:
SELECT
    customerNumber,
    COUNT(*) AS number_payments,
    MIN(amount) AS min_purchase,
    MAX(amount) AS max_purchase,
    AVG(amount) AS avg_purchase,
    SUM(amount) AS total_spent
FROM payments
GROUP BY customerNumber
HAVING avg_purchase > 50000
;
#groups the rows in the payments table by the customerNumber column, and calculates the number of payments, minimum purchase amount, maximum purchase amount, average purchase amount, and total spent for each customer, only returning customers with an average purchase amount greater than $50,000

# with WHERE and HAVING
#let's say we want to filter based on customers who have made at least 2 purchases of over 50000 each.
SELECT
    customerNumber,
    COUNT(*) AS number_payments,
    MIN(amount) AS min_purchase,
    MAX(amount) AS max_purchase,
    AVG(amount) AS avg_purchase,
    SUM(amount) AS total_spent
FROM payments
WHERE amount > 50000
GROUP BY customerNumber
HAVING number_payments >= 2 #groups the rows in the payments table by the customerNumber column, and calculates the number of payments, minimum purchase amount, maximum purchase amount, average purchase amount, and total spent for each customer, 
#only returning customers who have made at least 2 purchases of over $50,000 each

#ORDER BY
SELECT
    customerNumber,
    COUNT(*) AS number_payments,
    MIN(amount) AS min_purchase,
    MAX(amount) AS max_purchase,
    AVG(amount) AS avg_purchase,
    SUM(amount) AS total_spent
FROM payments
WHERE amount > 50000
GROUP BY customerNumber
HAVING number_payments >= 2
ORDER BY total_spent
LIMIT 1

## ORDER BY

ORDER BY allows you to organize result sets alphabetically or numerically and in ascending or descending order.

In [ ]:
# ORDER BY
SELECT first_name, last_name, email
FROM employee
ORDER BY last_name DESC,
         first_name DESC; #selects all rows from the employee table, and orders the results by the last_name column in descending order

#ORDER BY ASC
SELECT first_name, last_name, email
FROM employee
ORDER BY last_name ASC,
         first_name ASC; #selects all rows from the employee table, and orders the results by the last_name column in ascending order

#AFTER WHERE CLAUSE AND GROUP BY
SELECT first_name, COUNT(*)
    FROM employee
     WHERE office_id = '1'
     GROUP BY first_name
     ORDER BY COUNT(*) DESC; #groups the rows in the employee table by the first_name column, and counts the number of rows in each group where the office_id column is '1',

## LIMIT

In [ ]:
## LIMIT
SELECT first_name, last_name, email
FROM employee
ORDER BY last_name DESC,
         first_name DESC
LIMIT 10; #selects the first 10 rows from the employee table, and orders the results by the last_name column in descending order

## LIKE

In [ ]:
## LIKE
SELECT first_name, last_name, email
FROM employee
WHERE email LIKE '%@gmail.com'; #selects all rows from the employee table where the email column contains the string '@gmail.com'

#TO GET THE FIRST CHARACTER OF A COLUMN
SELECT *
  FROM cats
 WHERE name LIKE 'M%'; #selects all rows from the cats table where the name column starts with the letter 'M'

OR USING SUBSTR

SELECT *
  FROM cats
 WHERE substr(name, 1, 1) = "M"; 

#TO GET THE LAST CHARACTER OF A COLUMN
SELECT *
  FROM cats
 WHERE name LIKE '%y'; #selects all rows from the cats table where the name column ends with the letter 'y'

OR USING SUBSTR

SELECT *
    FROM cats
     WHERE substr(name, -1, 1) = "y";

#TO GET THE FIRST AND LAST CHARACTER OF A COLUMN
SELECT *
  FROM cats
 WHERE name LIKE 'M%y'; #selects all rows from the cats table where the name column starts with the letter 'M' and ends with the letter 'y'

OR USING SUBSTR

SELECT *
    FROM cats
     WHERE substr(name, 1, 1) = "M" AND substr(name, -1, 1) = "y";

# TO GET THE MIDDLE CHARACTER OF A COLUMN
SELECT *
  FROM cats
 WHERE name LIKE '_a%' OR '_a_'; #selects all rows from the cats table where the name column has 'a' as the second character

OR USING SUBSTR

SELECT *
    FROM cats
     WHERE substr(name, 2, 1) = "a";

## using the REGEXP instead of LIKE

In [ ]:
#1. Match beginning of string(^): Gives all the names starting with ‘sa’.Example- sam,samarth.
SELECT name
FROM student_tbl WHERE name REGEXP '^sa';

#2. Match the end of a string($): Gives all the names ending with ‘on’.Example – norton,merton.
SELECT name 
FROM student_tbl WHERE name REGEXP 'on$';


#3.Match zero or one instance of the strings preceding it(?): Gives all the titles containing ‘com’.Example – comedy , romantic comedy.
SELECT title
FROM movies_tbl WHERE title REGEXP 'com ?'; 

#4.matches any of the patterns p1, p2, or p3(p1|p2|p3): Gives all the names containing ‘be’ or ‘ae’.Example – Abel, Baer.
SELECT name
FROM student_tbl WHERE name REGEXP 'be|ae' ;

#5.Matches any character listed between the square brackets([abc]): Gives all the names containing ‘j’ or ‘z’.Example – Lorentz, Rajs.
SELECT name
FROM student_tbl WHERE name REGEXP '[jz]' ;

#6.Matches any lower case letter between ‘a’ to ‘z’- ([a-z]) ([a-z] and (.)): Retrieve all names that contain a letter in the range of ‘b’ and ‘g’, followed by any character, followed by the letter ‘a’.Example – Tobias, sewall. Matches any single character(.)
SELECT name
FROM student_tbl WHERE name REGEXP '[b-g].[a]' ;

#7.Matches any character not listed between the square brackets.([^abc]): Gives all the names not containing ‘j’ or ‘z’. Example – nerton, sewall.
SELECT name
FROM student_tbl WHERE name REGEXP '^[^jz]*$';

#8. Matches the end of words[[:>:]]: Gives all the titles ending with character “ack”. Example – Black.
SELECT title
FROM movies_tbl WHERE REGEXP 'ack[[:>:]]'; 

#9. Matches the beginning of words[[:<:]]: Gives all the titles starting with character “for”. Example – Forgetting Sarah Marshal.
SELECT title 
FROM movies_tbl WHERE title REGEXP '[[:<:]]for'; 

#10.Matches a character class[:class:]: i.e [:lower:]- lowercase character ,[:digit:] – digit characters etc. Gives all the titles containing alphabetic character only. Example – stranger things, Avengers.
SELECT title 
FROM movies_tbl WHERE REGEXP '[:alpha:]' ; #Contains only alphabetic characters


#11.Matches the beginning of all words by any character listed between the square brackets.(^[abc]): Gives all the names starting with ‘n’ or ‘s’. Example – nerton, sewall.
SELECT name FROM student_tbl WHERE name REGEXP '^[ns]' ;

SELECT DISTINCT CITY
FROM STATION
WHERE CITY REGEXP '^[AEIOUaeiou].*[AEIOUaeiou]$'; #selects all distinct city names from the STATION table where the city name starts with a vowel and ends with a vowel

SELECT DISTINCT CITY 
FROM STATION 
WHERE CITY NOT REGEXP '^[AEIOUaeiou]'
          OR CITY NOT REGEXP '[AEIOUaeiou]$'; #selects all distinct city names from the STATION table where the city name does not start with a vowel or does not end with a vowel

# To check tables present in the database

In [ ]:
#establish a connection 
conn = sqlite3.connect('data.sqlite') #connect to the data.sqlite database

#establish a cursor
mycursor = conn.cursor() #create a cursor object using the cursor() method

#execute a query to get the schema of the database
mycursor.execute("SELECT name FROM sqlite_master") #execute a query using the execute() method

#fetch the results of the query
tables = mycursor.fetchall() #fetch the results of the query using the fetchall() method

#loop through the results and print each table name
for table in tables:
    print(table[0]) #loop through the results using a for loop, and print each table name

# USING TWO TABLES

In [ ]:
SELECT cats.name, dogs.name
  FROM cats, dogs; #selects all rows from the cats and dogs tables, and returns a cartesian product of the two tables

# check for duplicates

In [ ]:
SELECT *, COUNT(*)
FROM cats 
GROUP BY name, breed, age, weight; #groups the rows in the cats table by the name, breed, age, and weight columns, and counts the number of rows in each group
HAVING COUNT(*) > 1; #only returns groups with more than one row

SELECT name, COUNT(*)
FROM cats
GROUP BY name #groups the rows in the cats table by the name column, and counts the number of rows in each group

# INSERT INTO
 to populate my table

In [ ]:
INSERT INTO cats (name, age, breed) 
VALUES ('Maru', 3, 'Scottish Fold'); # cats is the table name, name, age, breed are the columns in the table

#INSERT BY COPYING DATA FROM ANOTHER TABLE
INSERT INTO cats (name, age, breed)
SELECT name, age, breed
  FROM new_cats; #inserts rows into the cats table by copying the name, age, and breed columns from the new_cats table

#COPY DATA FROM A LOCAL FILE
INSERT INTO cats (name, age, breed)
FROM '/path/to/file.csv'; #inserts rows into the cats table by copying the name, age, and breed columns from the file.csv file

DELIMITER ',' CSV HEADER; #specifies that the file is a CSV file with a header row

# ALTER TABLE

In [ ]:
#1. TO ADD A COLUMN TO A TABLE
ALTER TABLE cats ADD COLUMN notes text;

#2. TO RENAME A COLUMN IN A TABLE
ALTER TABLE cats RENAME COLUMN notes TO comments;

#3. TO DROP A COLUMN FROM A TABLE
ALTER TABLE cats DROP COLUMN comments;

#4. TO MODIFY THE DATA TYPE OF A COLUMN IN A TABLE
ALTER TABLE cats MODIFY COLUMN name TYPE VARCHAR(50);

# UPDATE 

tO UPDATE ROW VALUES

In [ ]:
UPDATE cats SET name = "Hana" WHERE name = "Hannah"; #updates the name column in the cats table to "Hana" where the name column is "Hannah"

# DELETING DATA

In [ ]:
DELETE FROM [table name] WHERE [column name] = [value];

DELETE FROM cats WHERE id = 2;

conn.commit() #TO COMMIT CHANGES MADE

# IN Operator- filter based on specific list of values

In [ ]:
SELECT EmployeeID, FirstName, LastName, Department
FROM Employees
WHERE Department IN ('HR', 'IT', 'Finance'); #selects all rows from the Employees table where the Department column is 'HR', 'IT', or 'Finance'


##using subquery
SELECT OrderID, OrderDate, CustomerID
FROM Orders
WHERE CustomerID IN (
    SELECT CustomerID
    FROM Customers
    WHERE City = 'New York'
);
#selects all rows from the Orders table where the CustomerID column is in the result of a subquery that selects the CustomerID column from the Customers table where the City column is 'New York'

# SQL JOIN 

To join tables. 1. Identify the common traits of these tables.shared columns from the two tables

Automatically it is an inner join-selects records that have matching values in both tables.

In [ ]:
SELECT
    employees.name AS employee_name,
    employees.pay AS employee_pay,
    managers.name AS manager_name
FROM employees
JOIN managers
    ON employees.manager_id = managers.id 
; # employees.manager_id is the foreign key in the employees table that references the id column in the managers table
#ON tableA.column = tableB.column

"""
	employee_name	employee_pay	manager_name
0	Bob	                  3000.0	Steve
1	Karen	              4000.0	Steve
2	Patrick            	  4000.0	Spongebob

"""


OR #USING - Only if the column name is the same in both tables.

SELECT *
  FROM orderdetails
       JOIN products
       USING(productCode)
       LIMIT 10;  # using can be applied cause the column name productCode is the same in both tables

OR #USING ALIASES OF TABLES- aliases are used to shorten table names

SELECT *
  FROM orderdetails AS od
       JOIN products AS p
       ON od.productCode = p.productCode
       LIMIT 10;

#inner join 
SELECT ProductID, ProductName, CategoryName
FROM Products
INNER JOIN Categories ON Products.CategoryID = Categories.CategoryID; #selects the ProductID, ProductName, and CategoryName columns from the Products and Categories tables, and returns only the rows where the CategoryID column in the Products table matches the CategoryID column in the Categories table

#Join 3 tables

SELECT Orders.OrderID, Customers.CustomerName, Shippers.ShipperName
FROM ((Orders
INNER JOIN Customers ON Orders.CustomerID = Customers.CustomerID)
INNER JOIN Shippers ON Orders.ShipperID = Shippers.ShipperID);


#multiple tables 
q=("""
--connect employees with customers
SELECT e.firstName, e.lastName, p.productName
FROM employees AS e
JOIN customers AS c ON e.employeeNumber = c.salesrepEmployeeNumber
JOIN orders AS o ON c.customerNumber = o.customerNumber
JOIN orderdetails AS od ON o.orderNumber = od.orderNumber
JOIN products AS p ON od.productCode = p.productCode
""")
pd.read_sql(q,conn)

## LEFT JOIN

returns all records from the left table (table1), and the matched records from the right table (table2). The result is NULL from the right side if there is no match.

In [ ]:
SELECT *
  FROM products
       LEFT JOIN orderdetails
       USING(productCode);
# will return all rows from the products table and the matching rows from the orderdetails table. If there is no match, the result is NULL in the columns from the orderdetails table.

SELECT Customers.CustomerName, Orders.OrderID
FROM Customers
LEFT JOIN Orders
ON Customers.CustomerID=Orders.CustomerID
ORDER BY Customers.CustomerName;
#Select customerName from customers table and OrderID from Orders table where the customerID in the customers table matches the customerID in the Orders table.

"""
CustomerName	                  OrderID
Alfreds Futterkiste 	 
Ana Trujillo Emparedados y helados 	10308 
Antonio Moreno Taquería 	        10365 
Around the Horn 	                10383 
Around the Horn 	                10355 
"""

## RIGHT JOIN
Returns all the records from the right table(table2) and matching records on the left(table1) table

In [ ]:
SELECT Orders.OrderID, Employees.LastName, Employees.FirstName
FROM Orders
RIGHT JOIN Employees ON Orders.EmployeeID = Employees.EmployeeID
ORDER BY Orders.OrderID;

## OUTER JOIN/FULL OUTER JOIN

Returns all records/rows in both table1 and table 2, even null values

In [ ]:
SELECT Customers.CustomerName, Orders.OrderID
FROM Customers
FULL OUTER JOIN Orders ON Customers.CustomerID=Orders.CustomerID
ORDER BY Customers.CustomerName;

# SQL SubQueries

In [ ]:
SELECT
    name AS employee_name,
    pay AS employee_pay,
    (
        SELECT name
        FROM managers
        WHERE managers.id = employees.manager_id
    ) AS manager_name
FROM employees

"""
	employee_name	employee_pay	manager_name
0	Bob	                  3000.0	Steve
1	Karen	              4000.0	Steve
2	Patrick	              4000.0	Spongebob

"""

# used when combining more than one table 
##SINGLE ROW
SELECT name, (SELECT COUNT(*) FROM orders WHERE customer_id = c.id) AS order_count
FROM customers c; #selects the name column from the customers table, and counts the number of orders for each customer in the orders table


###USING FROM 

SELECT p.productName, od.total_number_of_orders
FROM products p
JOIN (
    SELECT productCode, SUM(quantityOrdered) AS total_number_of_orders
    FROM orderdetails
    GROUP BY productCode
) od ON p.productCode = od.productCode
ORDER BY od.total_number_of_orders DESC;

###
SELECT p.productName, total_orders.total_number_of_orders
FROM products p
JOIN (
    SELECT productCode, SUM(quantityOrdered) AS total_number_of_orders
    FROM orderdetails
    GROUP BY productCode
) total_orders ON p.productCode = total_orders.productCode;

##USING WHERE
SELECT name
FROM customers
WHERE id IN (SELECT customer_id FROM orders WHERE order_date > '2023-01-01');

#HAVING CLAUSE
SELECT department, COUNT(*)
FROM employees
GROUP BY department
HAVING COUNT(*) > (SELECT AVG(emp_count) FROM (SELECT department, COUNT(*) AS emp_count FROM employees GROUP BY department) dept_counts);

# Normalization

1. 1NF - ensure each value is unique and not empty
2. 2NF - 1NF has to be satisfied and each column should be dependent on the 
primary key 
3. 3NF - ensure 2NF is satisfied,create new tables and establish connections 
among them

# RELATIONSHIPS
one-to-one: one data in one table relates to the only one data in another table it is known as one-to-one (1:1) relationship.
eg one user can have one address and one address can belong to only one user.

one-to-many:  one data in one table relates to the multiple data in another table it is known as the one-to-many (1:M) relationship.
eg. as single customer from customers table can have multiple orders in the orders table

many-to-many: multiple records in one table relate to multiple records in another table.
in three tables customers, orders, orderhistory;
a customer can order multiple items, an item can be ordered multiple times.